package com.google;

public class Main {

    public static void main(String[] args) {








//        Задание 1.
//        Написать программу, где объявлены и проинициализированы все примитивные типы данных.
//        (byte, short, int, long, float, double, char, boolean)
//        Необходимо вывести на экран все значения этих переменных.
//        Пример:
//        Значение типа byte = 10
//        Значение типа short = 100
//        и т д.







        byte b = 10;
        short s = 100;
        int i = 1000;
        long l = 10000L;

        float f = 100.5f;
        double _d = 1000.5;

        char c = '\u2713';

        boolean b2 = true;


        System.out.println(b);
        System.out.println(s);
        System.out.println(i);
        System.out.println(l);
        System.out.println(f);
        System.out.println(_d);
        System.out.println(c);
        System.out.println(b2);


    }
}
